# # Типы данных в питоне 

# # 1. NoneType - Ничего, пустота -> None
# # 2. Boolean - Истина или ложь -> True/False
# # 3. str() - Строки -> "Hello world" , 'My name is john'
# # 4. Числовые типы данных:
#     #a) integer - int() - Целое число (-1, -2, 0.1) 
#     #b) float ()- Дробь
#     #c) complex() - Комплексные числа (3+5i6) 
    
# # 5. Списковые типы данных:
#     #a. list(список/массив) -> [1, 2, 3, None, 'Hello',True, False]
#     #b. tuple(кортеж) -> (1, 2, 3, 4, 5, None)
#     #c. range(пословательность) -> range (1->10)

# # 6.set() -> Множества 
# # 7.dict(словари) -> содержит данные в виде ключа и значения -> {1: ' One", 2: 'Two'}


# ******************************************


# Mutable(Изменяемые типы данных)
#         1. list [1,5,3]
#         2. set
#         3. dict {1:3}

# Immitable(неизменяемые типы данных)        
#         1. NoneType
#         2. boolean
#         3. int float complex
#         4. str
#         5. range
#         6. tuple
#         7. frozenset



# # *******************************************        


# Стандартный вывод данных


# в пайтоне для вывода данных в терминал используется встроенная функция print()

# print('Hello world!')
# print(27*6)

# '''''Стандартный ввод данных'''
# через терминал используется фкнкция input()

# a = input('Введите число:')
# print ('В a хранится :')
# print (a)

# print (input('Введите свое имя :'))

